[
  {
  "title" : "Robotronics Club-IoT Weekend",
  "date" : "04/03/2019",
  "article" : "This was a next level for the students after we had conducted the 3 session series on Introduction to Arduino and basics. Raspberry Pi, interfacing of it, Internet of Things and its applications were the prime topics we covered in this 3-day weekend workshop.<br /> There were 3 sessions, each being of 1.5 - 2 hours, organized on 2nd, 3rd and 4th March, 2019 in A1-NKN, as we got an extra holiday on Monday (Maha Shivratri).<br />The three sessions were based respectively on<br />1. Raspberry Pi, its setup and interfacing with an LED and other various sensors.<br />2. NodeMCU - ESP8266 module, its basics.<br />3. NodeMCU and post basics and interfacing for basic IoT applications.<br />All the sessions were organized and managed by the students - 2nd year core members and club coordinator from 3rd year - Gaurav Kumar. Every session was planned a day before and executed properly then.<br />Components for the same were mostly issued from within the Institute and hence the cost for this workshop was minimal. Following components have been bought after the Workshop to provide them for various IoT based projects to the IIT Mandi students."
  },
  {
    "title" : "Robotronics Club-ROBOSOCCER",
    "date" : "09/03/2019",
    "article" : "The competition was held on 9th March ‘19, the first day of Utkarsh ‘19, the intra-college technical festival of IIT Mandi. Coordinated by two of the core members – Swarna Bisane (2nd year) & Akashdeep batham(2nd year) it was planned and executed well. Venue for the competition was basketball court.<br>Students (in teams) were given a problem statement (1) according to which they had to build robo-soccer bots with the components issued by the club and then compete in the competition.<br>It was kept open for all. There were 6 teams in total with 4-5 members in each team took part in the event. Snacks for the participants were provided as a part of Utkarsh itself from the technical society.<br>Prizes kept for the competition were worth 3000/-"
  },
  {
    "title" : "Programming Club-Brunch",
    "date" : "10/11/2018",
    "article" : "Brunch is a competitive coding competition which  was held on Nov/10/2018 8:05pm in PC Lab in South Campus based on Mail.Ru Cup 2018 Round 2 on Codeforces.  It was attended by students of all years and saw a participation of around 50 students. The contest was held for 2 hours and participation was healthy.<br>The contest was won by Akhilesh Devrari, Avinav Sanyal and Sujjeth Ranganath.<br>Prizes were given to top 3 and first from all years to motivate participation - Kushagra Singhal, Vishal Anand, Milind Topno and Aaditya Arora.<br>"
  },
  {
    "title" : "Programming Club-Crack The Code",
    "date" : "27/01/2019",
    "article" : "Crack the code is a Capture The Flag event  that was held on January 27 from 7pm till 12 midnight online during the winter vacations. Capture the Flag (CTF) is a special kind of information security competitions that has started to be held in our college from last session.  The event witnessed a huge participation of 73 students from all years. The winners are -<br>1) Dheeraj Yadav<br>2) Siddharth Mittal<br>3) Vipul Sharma<br>4) Akshat Malviya (First problem solver for 3 Questions)<br>The event was created and setted by Anant Mishra on a platform developed by Abhigyan Khaund who are appreciated for their time and effort through coupons."
  },
  {
    "title" : "Nirmaan Club-PLOT IT",
    "date" : "09/03/2019",
    "article" : "what was event about : <br>Plot It is an event organized by the Nirmaan club in Utkarsh 2k19.The event includes the survey knowledge of the students and test their technicality with the instrument given o plot a given area. <br> When did the event take place: <br>The event took place on 9th march and the timmings were 1 p.m. to 5 p.m. The venue of the event was the volleyball court and the lawn tennis court . <br>Who was there : <br>This was opportunity for the 2nd year students to brush up their skills of survey that they received in their semester and participation was also active in the post graduation  year .Interest was shown by the students of different branches as well . <br>Total Participants : - 25"
  },
  {
    "title" : "Nirmaan and Yantrik Club-AutoCAD Designing Competition ",
    "date" : "15/04/2019",
    "article" : "An AutoCAD 2D designing competition was organised by Nirmaan Club on 15 April ‘19. <br>9 students participated in the event held in A1-3. There were 2 problem figures which the students had to make in the given time. <br>The results were judged based on time taken and the accuracy of the figure. <br>Sajeev stood at first position. "
  },
  {
    "title" : "Robotronics Club-Maze Solver",
    "date" : "09/03/2019",
    "article" : "The competition was held on 9th March ‘19, the first day of Utkarsh ‘19, the intra-college technical festival of IIT Mandi. Coordinated by two of the core members – Vaishali Gojra (2nd year) and Deepshikha Rana (2nd year) it was planned and executed well. Venue for the competition was SC-NKN.<br>Students were given a problem statement (1) according to which they had to build maze solving robot with the components issued by the club and then compete in the competition. The bot which completed the maze in minimum time including all penalties was the winner.<br>It was kept open for first year (B.Tech) and  6 teams with 3-5 members in each team took part in the event. Snacks were provided to the participants as a part of Utkarsh ‘19 by the technical society."
  },
  {
    "title" : "Robotronics Club-Winter Vacation Projects",
    "date" : "Throughout Winter Vacations",
    "article" : "As a part of the club’s vision - to develop a research culture among students, We issued components to all the interested students this winter vacations with an incentive for whoever makes a nice working project as a motivation.<br>Students were free to make anything they wanted with the components by following online tutorials and the previous sessions we had kept. <br>A few of the projects that the students worked on were:<br>a) Self balancing robot - Khyati Agarwal<br>b) Obstacle avoiding robot - Dipanshu Verma<br>c) Arduino based alarm clock - Awantika Singh<br>d) Bluetooth based RC car - Prakhar Uniyal<br>e) Speech recognition based home automation - Nidhi Jain<br>f) Wall Follower - Vikas Kumar Verma<br>And many students tried their hands on normal interfacing of sensors and devices with Arduino board and Raspberry Pi. All the above mentioned students are from 1st year.<br>After the vacations, the components, if the student has disassembled the project were taken back by the club."
  },
  {
    "title" : "Programming Club-ACM ICPC",
    "date" : "23/10/2018",
    "article" : "The ACM ICPC is considered as the 'Olympics of Programming Competitions'. It is quite simply, the oldest, largest, and most prestigious programming contest in the world.<br>The ACM-ICPC (Association for Computing Machinery - International Collegiate Programming Contest) is a multi-tier, team-based, programming competition.<br>ACM club of IIT Mandi is grateful to award top 2 performers from IIT Mandi who participated in ACM-ICPC competition held in december.<br>As an award t-shirts will be provided to the contestants who participated and performed well in the competition.<br>Name of the top performers :<br>1) Team1 - 'name.rand()'<br>2) Team2 - 'MakeItHappen'<br>"
  },
  {
    "title" : "ASTROPHOTOGRAPHY WORKSHOP REPORT SHUTTERBUGS (PHOTOGRAPHY CLUB)",
    "date" : "5-6 April 2019",
    "article" : "Shutterbugs, the photography club of IIT Mandi organised a workshop on Astrophotography in association with NIKON INDIA on 5th April.<br>A total of 29 college students consisting participants form both UG and PG along with Mr. Pavin Samuel boarded the institute bus at 5:30 pm on 5th April from South Campus for Parashar Lake. The bus reached the destination at 7:30 pm. After reaching, the students had their dinner and freshened up at the booked guest houses. After packing up the equipments and tents (taken from H&T club) everyone set off for the shooting location (Parashar Lake) at 10 pm.<br>At the photography spot, Mr Aman Wilson, Manager, Nikon India and his team were already present and had made the setup for the workshop. The workshop began with a brief description from Mr Aman Wilson about the major techniques of photography to be covered during the night, i.e., astrophotography, light painting and Steel wool photography.<br>The students began clicking and experimenting with the camera setups soon after, capturing captivating photos of the magnificent starry night. The workshop attendees tried out various techniques like clicking star trails, long exposure, light painting, milky way capture, steel wool, a combination of light painting and astrophotography, a combination of steel wool and astrophotography and many more. After a satisfied session the students went back to the guest houses to rest as per their own convenience.<br>The next morning, everyone had an early breakfast followed by a group photo with the workshop organisers. The attendees boarded the bus at 8:00 AM and reached the campus at around 10:30 AM. Everyone including the workshop trainers was contented with the successful organisation of the workshop and are looking forward for more such workshops and association with NIKON India in the future."   
  },
  {
    "title" : "IIT Mandi Robowars Team becomes First Runner up in EXODIA-Robowars Event",
    "date" : "12-14 April 2019",
    "article" : "Robowars is one of the event which is held in out tech-cult fest Exodia each year which was held on 12, 13 and 14th April. This year a total of 8 teams participated and out of which our college was FIRST RUNNER-UP and this was the best performance we have had until now. Apart from that our college was also selected for the first time in IIT Bombay’s technical fest this year but due to time and budget constraints we were not able to complete our bot. We see forward to perform good this time.<br>The project is led by Atyant Yadav, one of the core member of the club and there are 15 other students in total,  three 3rd year, seven 2nd year and five 1st year students.<br>A budget of 10,233 rupees was estimated for this project (Brief description on the expenditure is provided below) and parts were ordered and most of the mechanical parts including chasis of bot and mechanical parts including roller and defensive cast was made by students in mechanical lab and all the parts were then assembled."   
  },
  {
    "title" : "Art Geeks Vibgyor '19",
    "date" : "5-7 April 2019",
    "article" : "Art Geeks, conducted many competitions for 3 days on 5- 7th April under the name Vibgyor , during this time the competitions which took place were painting, sketching, origami, tattoo making and stencil. Participation this time was really good with really good submissions and about 100 entries in all. We had an exhibition on 7th April and the event was judged by  Dr. Astrid Kiehn, Dr. Shyamasree Dasgupta, with new categories like people’s choice award.<br>During the event there were club members present to provide all the art stuff required by the volunteers and also created a good ambience for the volunteers."   
  },
  {
    "title" : "ACM Club Dementia 2019",
    "date" : "26th April 2019",
    "article" : "Dementia 2019 (https://www.codechef.com/DEMA2019) was a Worldwide Rated Competitive Programming contest held on Codechef by our college’s ACM Student Chapter. It was a contest which was rated for Division 2 participants (https://www.codechef.com/ratings/divisions) and was organized on 26th April 2019 from 10:15 PM – 1:15AM (3 hours long contest).<br>About the contest hosting platform: CodeChef (https://www.codechef.com/) is a reputed competitive programming website where programmers all around the world practice solving problems and time to time contests are held. Rated and unrated contests are held periodically by programmers all over the world and a good amount of prizes are distributed for the top performers.<br>Links related to the contest:<br>Link for the contest: https://www.codechef.com/DEMA2019<br>Invitation on Codechef: https://discuss.codechef.com/t/invitation-to-dementia-2019-contest-rated-for-div2/24658<br>Invitation on Codeforces: https://codeforces.com/blog/entry/66693<br>Final combined (Division1 + Divison2) ranklist: https://docs.google.com/spreadsheets/d/1FE33tRinSO59nqnz1GYouQNTeZCSq4RkWAqdMK1Qn-s/edit#gid=512494309<br>Prize registrations: https://docs.google.com/spreadsheets/d/1F_G-hNuzkaoK7PD-6R7u3xf3bzduW7fclL21X60KzHs/edit?usp=sharing"
  }
]
