[
  {
  "title" : "Robotronics Club-IoT Weekend",
  "date" : "04/03/2019",
  "article" : "This was a next level for the students after we had conducted the 3 session series on Introduction to Arduino and basics. Raspberry Pi, interfacing of it, Internet of Things and its applications were the prime topics we covered in this 3-day weekend workshop.<br /> There were 3 sessions, each being of 1.5 - 2 hours, organized on 2nd, 3rd and 4th March, 2019 in A1-NKN, as we got an extra holiday on Monday (Maha Shivratri).<br />The three sessions were based respectively on<br />1. Raspberry Pi, its setup and interfacing with an LED and other various sensors.<br />2. NodeMCU - ESP8266 module, its basics.<br />3. NodeMCU and post basics and interfacing for basic IoT applications.<br />All the sessions were organized and managed by the students - 2nd year core members and club coordinator from 3rd year - Gaurav Kumar. Every session was planned a day before and executed properly then.<br />Components for the same were mostly issued from within the Institute and hence the cost for this workshop was minimal. Following components have been bought after the Workshop to provide them for various IoT based projects to the IIT Mandi students."
  },
  {
    "title" : "Robotronics Club-ROBOSOCCER",
    "date" : "09/03/2019",
    "article" : "The competition was held on 9th March ‘19, the first day of Utkarsh ‘19, the intra-college technical festival of IIT Mandi. Coordinated by two of the core members – Swarna Bisane (2nd year) & Akashdeep batham(2nd year) it was planned and executed well. Venue for the competition was basketball court.<br>Students (in teams) were given a problem statement (1) according to which they had to build robo-soccer bots with the components issued by the club and then compete in the competition.<br>It was kept open for all. There were 6 teams in total with 4-5 members in each team took part in the event. Snacks for the participants were provided as a part of Utkarsh itself from the technical society.<br>Prizes kept for the competition were worth 3000/-"
  }
]
